_posts/2026-01-24-post-proactor.md
```mermaid
classDiagram
direction TB

class Initiator

class AsynchronousOperationProcessor {
  +execute_async_operation()
}

class AsynchronousOperation {
  +async_operation()
}

class CompletionEventQueue

class AsynchronousEventDemuxer {
  +get_completion_event()
}

class Proactor {
  +handle_events()
}

class Handle

class CompletionHandler {
  +handle_event()
}

class ConcreteCompletionHandler

Initiator --> AsynchronousOperationProcessor : << uses >>
Initiator --> AsynchronousOperation : << invokes >>
Initiator --> CompletionHandler : << uses >>

AsynchronousOperationProcessor --> CompletionEventQueue : << enqueues >>
AsynchronousEventDemuxer --> CompletionEventQueue : << dequeues >>

Proactor --> AsynchronousEventDemuxer : << uses  >>
Proactor --> CompletionHandler : << demultiplexes & dispatches  >>

AsynchronousOperation --> Handle : is associated with
Handle --> CompletionHandler : is associated with

ConcreteCompletionHandler --|> CompletionHandler

AsynchronousOperationProcessor ..> AsynchronousOperation : << concurrency >>

```
