_posts/2026-01-24-post-proactor.md
```mermaid
sequenceDiagram
    participant I as Initiator
    participant AOP as Asynchronous Operation Processor
    participant AO as Asynchronous Operation
    participant CEQ as Completion Event Queue
    participant P as Proactor
    participant CH as Completion Handler


    
    I->>AOP: execute_async_operation()
    activate AOP

    AOP->>AO: async_operation()
    activate AO

    I->>P: handle_events()
    activate P

    AO->>AO: event
    AO-->>AOP: Result
    deactivate AO

    AOP->>CEQ: enqueue(Result)
    deactivate AOP



    CEQ-->>P: event

    P->>CH: handle_event(Result)
    activate CH

    CH->>CH: service()
    CH-->>P: (done)
    deactivate CH

    deactivate P

```
