_posts/2026-01-24-post-proactor.md
```mermaid
sequenceDiagram
    participant C as Client
    participant A as Acceptor
    participant S as ServerEventHandler
    participant P as Proactor Thread
    participant AW as AsynchWriteStream

    S->>AW: write(buffer)
    activate S
    deactivate S
    activate AW
    AW->>P: startAio()
    Note over P: Registers Async Op
    deactivate AW
    P->>C: Send Data ( "Echo - message" )
    Note over P: Event Loop Detects I/O Completion
    P->>P: postCompletion()
    P->>S: handleWriteStream(Result)
    activate S
    deactivate S
```
